# TestPoint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudFilter..::..TestPoint Method
PointCloudFilter Class See Also
---
Checks if a point is inside the volume of interest.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool TestPoint(
	CloudPoint point
)
```

Visual Basic
---
```text
Public Overridable Function TestPoint ( _
	point As CloudPoint _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool TestPoint(
	CloudPoint point
)
```

# ### Parameters
point
    Type: Autodesk.Revit.DB.PointClouds..::..CloudPointThe point to be tested.
# ### Return Value
If true, the point is accepted, if false, the point is not accepted.
# See Also
PointCloudFilter Class
Autodesk.Revit.DB.PointClouds Namespace